{"keras_version": "2.2.4", "class_name": "Model", "config": {"layers": [{"config": {"batch_input_shape": [null, 28, 28, 1], "sparse": false, "dtype": "float32", "name": "input_1"}, "name": "input_1", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"layers": [{"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "batch_input_shape": [null, 28, 28, 1], "data_format": "channels_last", "kernel_size": [3, 3], "strides": [2, 2], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "activation": "linear", "dilation_rate": [1, 1], "filters": 16, "kernel_regularizer": null, "name": "conv2d_1", "padding": "same", "dtype": "float32"}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_1", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_1", "trainable": true, "rate": 0.25, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_size": [3, 3], "data_format": "channels_last", "strides": [2, 2], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "activation": "linear", "dilation_rate": [1, 1], "filters": 32, "kernel_regularizer": null, "name": "conv2d_2", "padding": "same"}}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_1", "trainable": true, "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_2", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_2", "trainable": true, "rate": 0.25, "noise_shape": null}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": true, "trainable": true, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "momentum": 0.8, "name": "batch_normalization_1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_size": [3, 3], "data_format": "channels_last", "strides": [2, 2], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "activation": "linear", "dilation_rate": [1, 1], "filters": 64, "kernel_regularizer": null, "name": "conv2d_3", "padding": "same"}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_3", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_3", "trainable": true, "rate": 0.25, "noise_shape": null}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": true, "trainable": true, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "momentum": 0.8, "name": "batch_normalization_2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "activation": "linear", "dilation_rate": [1, 1], "filters": 128, "kernel_regularizer": null, "name": "conv2d_4", "padding": "same"}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_4", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_4", "trainable": true, "rate": 0.25, "noise_shape": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}}], "name": "sequential_1"}, "name": "sequential_1", "class_name": "Sequential", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "units": 1, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "activation": "sigmoid", "name": "dense_1", "kernel_regularizer": null}, "name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["sequential_1", 1, 0, {}]]]}, {"config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "units": 10, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "activation": "softmax", "name": "dense_2", "kernel_regularizer": null}, "name": "dense_2", "class_name": "Dense", "inbound_nodes": [[["sequential_1", 1, 0, {}]]]}], "name": "model_1", "output_layers": [["dense_1", 0, 0], ["dense_2", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "backend": "tensorflow"}