{"keras_version": "2.2.4", "class_name": "Model", "config": {"layers": [{"config": {"batch_input_shape": [null, 1], "sparse": false, "dtype": "int32", "name": "input_3"}, "name": "input_3", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}}, "input_dim": 10, "dtype": "float32", "activity_regularizer": null, "mask_zero": false, "trainable": true, "output_dim": 100, "embeddings_regularizer": null, "embeddings_constraint": null, "batch_input_shape": [null, null], "name": "embedding_1", "input_length": null}, "name": "embedding_1", "class_name": "Embedding", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"config": {"batch_input_shape": [null, 100], "sparse": false, "dtype": "float32", "name": "input_2"}, "name": "input_2", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"name": "flatten_2", "trainable": true, "data_format": "channels_last"}, "name": "flatten_2", "class_name": "Flatten", "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"config": {"name": "multiply_1", "trainable": true}, "name": "multiply_1", "class_name": "Multiply", "inbound_nodes": [[["input_2", 0, 0, {}], ["flatten_2", 0, 0, {}]]]}, {"config": {"layers": [{"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "units": 6272, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_regularizer": null, "batch_input_shape": [null, 100], "activity_regularizer": null, "bias_constraint": null, "trainable": true, "activation": "relu", "dtype": "float32", "name": "dense_3", "kernel_regularizer": null}}, {"class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "target_shape": [7, 7, 128]}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": true, "trainable": true, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "momentum": 0.8, "name": "batch_normalization_3", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}}, {"class_name": "UpSampling2D", "config": {"interpolation": "nearest", "name": "up_sampling2d_1", "trainable": true, "data_format": "channels_last", "size": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "activation": "linear", "dilation_rate": [1, 1], "filters": 128, "kernel_regularizer": null, "name": "conv2d_5", "padding": "same"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": true, "trainable": true, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "momentum": 0.8, "name": "batch_normalization_4", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}}, {"class_name": "UpSampling2D", "config": {"interpolation": "nearest", "name": "up_sampling2d_2", "trainable": true, "data_format": "channels_last", "size": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "activation": "linear", "dilation_rate": [1, 1], "filters": 64, "kernel_regularizer": null, "name": "conv2d_6", "padding": "same"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": true, "trainable": true, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "momentum": 0.8, "name": "batch_normalization_5", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "activation": "linear", "dilation_rate": [1, 1], "filters": 1, "kernel_regularizer": null, "name": "conv2d_7", "padding": "same"}}, {"class_name": "Activation", "config": {"activation": "tanh", "name": "activation_3", "trainable": true}}], "name": "sequential_2"}, "name": "sequential_2", "class_name": "Sequential", "inbound_nodes": [[["multiply_1", 0, 0, {}]]]}], "name": "model_2", "output_layers": [["sequential_2", 1, 0]], "input_layers": [["input_2", 0, 0], ["input_3", 0, 0]]}, "backend": "tensorflow"}